Процедура ДобавитьВРегистр(Пользователь,ПервыйПараметр,СтрокаЗапроса) Экспорт  
	/// Ускорения просто пишем. нужна история входящих пакетов
	МенеджерЗаписи = РегистрыСведений.Request.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Users = Пользователь;
	МенеджерЗаписи.UnixTimestamp=ОбщиеДляВремени.ВUnixTime();
	МенеджерЗаписи.FrisrtRowHttp = ПервыйПараметр;
	МенеджерЗаписи.FullRowStr = СтрокаЗапроса;
	МенеджерЗаписи.Записать();	
	
КонецПроцедуры

/// Добавление в РС ОшибкиНаСтроне 
/// Без отбора для скорости записи
Процедура ДобавитьВОшибкиНаСтроне(СтруктураДляДобавления, ПолныйJSON) Экспорт 
	// Справедливотсти ради считаем что запись идет по трем ключас и совпадения не возможны
	МенеджерЗаписи = РегистрыСведений.ОшибкиНаСтроне.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Клиент = СтруктураДляДобавления.Client;
	МенеджерЗаписи.ВремяUnix = ОбщиеДляВремени.ВUnixTime(ТекущаяДата());
	МенеджерЗаписи.ТекущийПользователь = СтруктураДляДобавления.UserName;
	МенеджерЗаписи.ИмяМодуля = СтруктураДляДобавления.ModuleName;
	МенеджерЗаписи.ИсходнаяСтрока = СтруктураДляДобавления.SourceString;
	МенеджерЗаписи.СтрокаНомер = СтруктураДляДобавления.NumberRow;
	МенеджерЗаписи.Описание = СтруктураДляДобавления.Description;
	МенеджерЗаписи.ВерсияПриложения = СтруктураДляДобавления.PlatformVersion;
	МенеджерЗаписи.ДатаПолучения = ТекущаяДата();
	МенеджерЗаписи.ДатаОтправки = СтруктураДляДобавления.DateSend;
	МенеджерЗаписи.ПолныйJSON = ПолныйJSON;
	Попытка	
		МенеджерЗаписи.Записать()
    Исключение
        ЗаписьЖурналаРегистрации("ДобавитьВОшибкиНаСтроне", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при записи  " + ОписаниеОшибки());
    КонецПопытки;	

КонецПроцедуры
