
Функция fortestGET(Запрос)
	trrow="nan";
	trrow = Запрос.ПараметрыЗапроса.Получить("tr");
//	ПользовательВызвавший = "TEST";
	ПользовательВызвавший=ПользователиИнформационнойБазы.ТекущийПользователь();
	ПервыйПараметр = +trrow;
	// 
	СтрокаЦеликом = "";
	//	
	ОбщийДляРегистраСведений.ДобавитьВРегистр(ПользовательВызвавший,ПервыйПараметр,СтрокаЦеликом);

    Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Данный HTTP-сервис " + Запрос.HTTPМетод+" trrow "+trrow);
	Возврат Ответ;


КонецФункции

Функция fortestPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	// Закидываем JSON
	
	Возврат Ответ;
КонецФункции
