
Функция fortestGET(Запрос)
	trrow="nan";
	trrow = Запрос.ПараметрыЗапроса.Получить("tr");
	ПользовательВызвавший=ПользователиИнформационнойБазы.ТекущийПользователь();
	ПервыйПараметр = trrow;
	СтрокаЦеликом = "";
	Для Каждого КлючИЗначение Из Запрос.ПараметрыЗапроса Цикл
		СтрокаЦеликом = СтрокаЦеликом +" "+КлючИЗначение.Ключ+" "+КлючИЗначение.Значение+";";
	КонецЦикла;
	
	
	
	ОбщийДляРегистраСведений.ДобавитьВРегистр(ПользовательВызвавший,ПервыйПараметр,СтрокаЦеликом);
    Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json;charset=utf-8");
	Ответ.УстановитьТелоИзСтроки("Данный HTTP-сервис " + Запрос.HTTPМетод+" trrow "+trrow);
	Возврат Ответ;


КонецФункции

Функция fortestPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	// Закидываем JSON
	
	Возврат Ответ;
КонецФункции
