
&После("ОбработкаОтображенияОшибки")
Процедура web2ОбработкаОтображенияОшибки(ИнформацияОбОшибке, ТребуетсяЗавершениеСеанса, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// Модуль обработки
	СоответствиеJson = Новый Соответствие;
//	СоответствиеJson.Вставить(""
	СтрокаJson=СтруктураВСтрокуJSON(ИнформацияОбОшибке);
	
КонецПроцедуры

Функция СтруктураВСтрокуJSON(Значение)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Значение);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции
