
&После("ОбработкаОтображенияОшибки")
Процедура web2ОбработкаОтображенияОшибки(ИнформацияОбОшибке, ТребуетсяЗавершениеСеанса, СтандартнаяОбработка)
	
	
		СтандартнаяОбработка = Ложь;
		СисИнфо = Новый  СистемнаяИнформация;
		СоответствиеJson = Новый Соответствие;
		
		СоответствиеJson.Вставить("Client","Client"); // Тут нужен из настроек брать имя клиента можно вычислять на своей стороне от IP Что за клиент
		СоответствиеJson.Вставить("ModuleName",СокрЛП(ИнформацияОбОшибке.ИмяМодуля));
		СоответствиеJson.Вставить("SourceString",СокрЛП(ИнформацияОбОшибке.ИсходнаяСтрока));
		СоответствиеJson.Вставить("NumberRow",СокрЛП(ИнформацияОбОшибке.НомерСтроки));
		СоответствиеJson.Вставить("Description",СокрЛП(ИнформацияОбОшибке.Описание));
		СоответствиеJson.Вставить("UserName", СокрЛП(ПользователиКлиент.ТекущийПользователь()));
		СоответствиеJson.Вставить("PlatformVersion",СокрЛП(СисИнфо.ВерсияПриложения));
		
		СтрокаJson=СтруктураВСтрокуJSON(СоответствиеJson);
		
		// Оправка данных
		HTTPСоединение = Новый HTTPСоединение("127.0.0.1","8532");
		HTTPЗапрос = Новый HTTPЗапрос("/hs/webroot/fortest");
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJson,"UTF-8",ИспользованиеByteOrderMark.НеИспользовать);
		
		Результат = HTTPСоединение.Получить(HTTPЗапрос);
		
		
	
КонецПроцедуры

Функция СтруктураВСтрокуJSON(Значение)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Значение);
	ЗаписьJSON.Закрыть();
	
	Возврат ЗаписьJSON
	
КонецФункции


